uat_chat/Reports/ItobОтчетПоИмпульснымДатчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>ItobОтчетПоИмпульснымДатчикам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobНазначенияДатчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

uat_chat/InformationRegisters/ItobПривязкиТерминалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ItobПривязкиТерминалов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТерминалУстановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobТерминалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Catalogs/ItobТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ItobТерминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IMEI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobМоделиТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерSimКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Датчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Датчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ItobДатчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ItobНазначенияДатчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КалибровочныйГрафик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ItobКалибровочныеГрафики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Reports/ItobОтчетПоИмпульснымДатчикам/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ
//

// Функция выполняет формирование табличного документа отчета по дискретным датчикам.
//
Функция СформироватьОтчетПоИмпульснымДатчикам(НачДата, КонДата, Объект, Назначение)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Отчет");
		
	// Данные датчика
	СрезНаНачало = РегистрыСведений.ItobПривязкиТерминалов.ПолучитьПоследнее(НачалоДня(НачДата)-1, Новый Структура("Объект", Объект));
	Если НЕ ЗначениеЗаполнено(СрезНаНачало.Терминал) Тогда
		Сообщить("Объект не привязан к терминалу!");
		Возврат ТабДок;
	
	КонецЕсли;	
	
	Терминал = СрезНаНачало.Терминал;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Терминал", Терминал);
	Запрос.УстановитьПараметр("Назначение", Назначение);	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ItobТерминалыДатчики.Датчик КАК Датчик
	               |ИЗ
	               |	Справочник.ItobТерминалы.Датчики КАК ItobТерминалыДатчики
	               |ГДЕ
	               |	ItobТерминалыДатчики.Ссылка = &Терминал
	               |	И ItobТерминалыДатчики.Назначение = &Назначение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Датчик
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	ТабДатчики = Запрос.Выполнить().Выгрузить();
	Если ТабДатчики.Количество() = 0 Тогда
		Сообщить("Для выбранного незначения не указаны датчики");
		Возврат ТабДок;
	
	КонецЕсли;
	
	ТабДанных = Новый ТаблицаЗначений;
	ТабДанных.Колонки.Добавить("ПериодДень");
	
	СтрКоличество = "";
	МассивИменКолонок = Новый Массив;
	
	ТабДок.Очистить();	
	Макет = ПолучитьМакет("Отчет");
	
	ОбластьШапкаЛев         = Макет.ПолучитьОбласть("Шапка|ЛеваяСторона");
	ОбластьШапкаДатчик         = Макет.ПолучитьОбласть("Шапка|Датчик");
	ОбластьШапкаИтог         = Макет.ПолучитьОбласть("Шапка|Итог");
	
	ОбластьШапкаЛев.Параметры.ЗаголовокОтчета = "Отчет по импульсным датчикам за "+ПредставлениеПериода(НачДата,КонДата);
	ОбластьШапкаЛев.Параметры.Объект = "Объект мониторинга: "+Объект+", датчик: "+Назначение;	
	ТабДок.Вывести(ОбластьШапкаЛев);
	
	Для каждого СтрДатчики Из ТабДатчики Цикл
		
		ОбластьШапкаДатчик.Параметры.ИмяДатчика = СтрДатчики.Датчик;
		ТабДок.Присоединить(ОбластьШапкаДатчик);
		
		ИмяКолонкиКоличество = "Количество_"+СокрЛП(СтрДатчики.Датчик.Код);
		ТабДанных.Колонки.Добавить(ИмяКолонкиКоличество, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(8,0)));
		
		МассивИменКолонок.Добавить(ИмяКолонкиКоличество);
		
		ТабРезультат = ItobОперативныйМониторинг.ПолучитьДанныеДатчикаОбъекта(Объект,НачДата,КонДата,СтрДатчики.Датчик);
		
		СтрКоличество = СтрКоличество + ?(СтрКоличество="","",",")+ИмяКолонкиКоличество;
		
		Если ТабРезультат.Количество() > 0 Тогда
			
			Для п = 1 По ТабРезультат.Количество()-1 Цикл
				
				НовСтрокаДанных = ТабДанных.Добавить(); 			
				НовСтрокаДанных.ПериодДень = НачалоДня(ТабРезультат[п].Период);
				НовСтрокаДанных[ИмяКолонкиКоличество] = ?(ТабРезультат[п].Значение >= ТабРезультат[п-1].Значение,
					ТабРезультат[п].Значение-ТабРезультат[п-1].Значение, ТабРезультат[п].Значение);			
				
			КонецЦикла;		
			
		КонецЕсли;	
		
	
	КонецЦикла;
	
	ТабДок.Присоединить(ОбластьШапкаИтог);
	
	ТабДанных.Свернуть("ПериодДень", СтрКоличество);
	ТабДанных.Сортировать("ПериодДень Возр");
			
	ОбластьДеталиЛев    = Макет.ПолучитьОбласть("Детали|ЛеваяСторона");	
	ОбластьДеталиДатчик = Макет.ПолучитьОбласть("Детали|Датчик");
	ОбластьДеталиИтог   = Макет.ПолучитьОбласть("Детали|Итог");
	
	НомПП = 1;
	
	Для Каждого СтрокаДанных Из ТабДанных Цикл
						
		ОбластьДеталиЛев.Параметры.НомПП = НомПП;
		ОбластьДеталиЛев.Параметры.ПериодДень = СтрокаДанных.ПериодДень;		
		ТабДок.Вывести(ОбластьДеталиЛев);
		
		ТекИтог = 0;
		Для каждого ИмяКолонкиДатчики Из МассивИменКолонок Цикл
			ОбластьДеталиДатчик.Параметры.Количество = СтрокаДанных[ИмяКолонкиДатчики]; 				
		    ТекИтог = ТекИтог + СтрокаДанных[ИмяКолонкиДатчики];
			ТабДок.Присоединить(ОбластьДеталиДатчик);
			
		КонецЦикла;
		
		ОбластьДеталиИтог.Параметры.Количество = ТекИтог;
		ТабДок.Присоединить(ОбластьДеталиИтог);
				
		НомПП = НомПП + 1;
	
	КонецЦикла;	
	
	ОбластьИтогЛев    = Макет.ПолучитьОбласть("ИтогСтрока|ЛеваяСторона");	
	ОбластьИтогДатчик = Макет.ПолучитьОбласть("ИтогСтрока|Датчик");
	ОбластьИтогИтог   = Макет.ПолучитьОбласть("ИтогСтрока|Итог");
		
	ТабДок.Вывести(ОбластьИтогЛев);
	
	ТекИтог = 0;
	Для каждого ИмяКолонкиДатчики Из МассивИменКолонок Цикл
		ОбластьИтогДатчик.Параметры.Количество = ТабДанных.Итог(ИмяКолонкиДатчики); 				
		ТекИтог = ТекИтог + ТабДанных.Итог(ИмяКолонкиДатчики);
		ТабДок.Присоединить(ОбластьИтогДатчик);
		
	КонецЦикла;
	
	ОбластьИтогИтог.Параметры.Количество = ТекИтог;
	ТабДок.Присоединить(ОбластьИтогИтог);
	
	
	Возврат ТабДок;

	
КонецФункции // СформироватьОтчетПоДискретнымДатчикам()

// Процедура обработчик события "ПриКомпоновкеРезультата" объекта
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
	ДокументРезультат.Вывести(СформироватьОтчетПоИмпульснымДатчикам(
		НачПериода,
		КонПериода,
		Объект,
		Назначение));
				
КонецПроцедуры // ПриКомпоновкеРезультата()
  
// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НачПериода > КонПериода Тогда
		ТекстОшибки = НСтр("ru='Начало периода не может быть больше даты конца периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			Неопределено, // ОбъектИлиСсылка
			"ItobОтчетПоИмпульснымДатчикам",
			"Отчет", // ПутьКДанным
			Отказ
		);
	КонецЕсли;
		
КонецПроцедуры // ОбработкаПроверкиЗаполнения()
